{
    "S:P Little Knight":
    {
        "comment":"I can say that S:P Little Knight is the most powerful, general used card in nowaday's enviroment since she was born. Unlike Baronne de Fleur or Super Starslayer TY-PHON - Sky Crisis, these two cards have relatively strict conditions to summon, you can use only two effect monsters to save the key monster from Nibiru, the Primal Being or can banish opponent's combo's key card by its second effect. Her first effect is even more icing on the cake. Not only can it deal with your own negated or used-up extra deck monsters that have become useless on the field, but it can also banish your opponent's crucial cards, making more troubles to your oppent."
    },
    "Promethean Princess, Bestower of Flames":
    {
        "comment":"As the rise of FIRE monsters, the place of Promethean Princess, Bestower of Flames has become more and more important in those mainstream decks. With the high compatibility to Snake-Eyes, R-ACE and Yubel, Promethean Princess not only can give the continuous resource for player's combos, but also a good interference to the oppent."
    },
    "Fiendsmith Engraver":
    {
        "comment":"A system without useless parts and capable of pseudo one-card combos? It's way better than Horus's Hapi that leaves you staring at your hand cards helplessly. Player can either summons a Beatrice, Lady of the Eternal for precise graveyard setup or summon a D/D/D Wave High King Caesar to ExpelliNibiru.\"Greatness, needless to say.\" "
    },
    "Phantom of Yubel":
    {
        "comment":"\"Fusion summon is the most noble method of summoning!\" From the power of Red-Eyes Dark Dragoon, Elder Entity Norden and Tearlaments Kitkallos, we sometimes must admit that the power of fushion is full of possibility. The second effect of Phantom of Yubel is not just negating as how Baronne de Fleur does, but also can give the continuous resource for player's combos, not to mention that her summoning condition is putting back player's used Yubel monsters to the deck and can resummoning them again."
    },
    "Diabellstar the Black Witch":
    {
        "comment":"Similar position as Fiendsmith Engraver but also a important part of Snake-Eyes' combo."
    },
    "Imsety, Glory of Horus":
    {
        "comment":"Similar position as Fiendsmith Engraver but can be powerful than Diabellstar the Black Witch and Fiendsmith Engraver in some condition, like when his friends stay away from player's hand card (Duamutef,Hapi and Qebehsenuef is watching you)."
    }
}